DinnerParty/app/views/invitations/index.html.erb

SELECT "guests".* FROM "guests" INNER JOIN "invitations" ON "guests"."id" = "invitations"."guest_id" WHERE "invitations"."dinner_id" = $1  [["dinner_id", 8]]
---
<ul>
<% @dinner.guests.each do |guest| %>