DinnerParty/app/views/invitations/new.html.erb

<%= form_for ([@dinner, @invitation]) do |f| %>
  <%= f.collection_check_boxes :user_ids, User.all, :id, :name %><br><br>
---
SELECT "users".* FROM "users"