DinnerParty/app/controllers/dinners_controller.rb

  def create
    @dinner = Dinner.create(dinner_params)
    @user = User.find_by(id: session[:user_id])
    @host = Host.find_or_create_by(user_id: @user.id)
    @dinner.host = @host
    @dinner.save
---
INSERT INTO "dinners" ("title", "date") VALUES ($1, $2) RETURNING "id"  [["title", "Jay's Party"], ["date", "2015-11-20 15:35:00.000000"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "hosts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 6], ["created_at", "2015-11-04 15:35:56.909569"], ["updated_at", "2015-11-04 15:35:56.909569"]]
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."user_id" = $1 LIMIT 1  [["user_id", 6]]
UPDATE "dinners" SET "host_id" = $1 WHERE "dinners"."id" = $2  [["host_id", 4], ["id", 8]]

  def edit
    @dinner = Dinner.find(params[:id])
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @dinner = Dinner.find(params[:id])
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 1]]

  def index
    @dinners = Dinner.all
---
SELECT "dinners".* FROM "dinners"

  def show
    @dinner = Dinner.find(params[:id])
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 2]]

  def destroy
    @dinner = Dinner.find(params[:id])
    @dinner.destroy
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "dinners" WHERE "dinners"."id" = $1  [["id", 5]]