DinnerParty/app/controllers/dish_assignments_controller.rb

  def new
    #all the available menu_items specific to that dinner
    #redirects to index
    @dinner = Dinner.find(params[:dinner_id])

    @menu_items = MenuItem.where(dinner_id: @dinner.id)

    @dish_assignment = DishAssignment.new

    main_dishes = MenuItem.joins(:dish).where(dinner_id: @dinner.id, dishes: {course: "Main Dish"})
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."dinner_id" = $1  [["dinner_id", 2]]
SELECT  "menu_items".* FROM "menu_items" INNER JOIN "dishes" ON "dishes"."id" = "menu_items"."dish_id" WHERE "menu_items"."dinner_id" = $1 AND "dishes"."course" = $2  ORDER BY "menu_items"."id" ASC LIMIT 1  [["dinner_id", 2], ["course", "Main Dish"]]