DinnerParty/app/controllers/dish_assignments_controller.rb

SELECT  "invitations".* FROM "invitations" WHERE "invitations"."guest_id" = $1 AND "invitations"."dinner_id" = $2  ORDER BY "invitations"."id" ASC LIMIT 1  [["guest_id", 3], ["dinner_id", 3]]
---
  def create
    @guest = Guest.find_by(user_id: current_user.id)
    @assignments = params[:dish_assignment][:menu_item_ids]
    @assignments.each do |assignment|
      DishAssignment.create(guest_id: @guest.id, menu_item_id: assignment)
      @guest.invitations.where(dinner_id: params[:dinner_id]).status = "Attending"

SELECT  "guests".* FROM "guests" WHERE "guests"."user_id" = $1 LIMIT 1  [["user_id", 6]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."dinner_id" = $1  [["dinner_id", 3]]
---
  def index
    @menu_items_by_course = MenuItem.index_by_course(@dinner.id)
    @guest = Guest.find_by(user_id: current_user.id)
    @my_items = @guest.dish_assignments
    @dishes_assigned = @dinner.taken_menu_items
    @available_menu_items = MenuItem.find(@menu_items_by_course.flatten(1).map(&:id) - @dishes_assigned)