DinnerParty/app/controllers/dish_assignments_controller.rb

SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 2]]
---
  def new
    @dinner = Dinner.find(params[:dinner_id])

SELECT  "guests".* FROM "guests" WHERE "guests"."user_id" = $1 LIMIT 1  [["user_id", 6]]
INSERT INTO "dish_assignments" ("guest_id", "menu_item_id") VALUES ($1, $2) RETURNING "id"  [["guest_id", 5], ["menu_item_id", 39]]
---
  def create
    @guest = Guest.find_by(user_id: current_user.id)
    @assignments = params[:dish_assignment][:menu_item_ids]
    @assignments.each do |assignment|
      DishAssignment.create(guest_id: @guest.id, menu_item_id: assignment)

SELECT  "guests".* FROM "guests" WHERE "guests"."user_id" = $1 LIMIT 1  [["user_id", 6]]
SELECT  "dish_assignments".* FROM "dish_assignments" WHERE "dish_assignments"."guest_id" = $1  ORDER BY "dish_assignments"."id" ASC LIMIT 1  [["guest_id", 5]]
SELECT "guests".* FROM "guests"
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."dinner_id" = $1  [["dinner_id", 2]]
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT 1  [["id", 39]]
---
  def edit
    @menu_items_by_course = MenuItem.index_by_course(@dinner.id)
    @guest = Guest.find_by(user_id: current_user.id)
    @my_items = @guest.dish_assignments#.map(&:menu_item)
    @dish_assignment = @my_items.first
    @dishes_assigned = @dinner.taken_menu_items
    @available_menu_items = MenuItem.find(@menu_items_by_course.flatten(1).map(&:id) - @dishes_assigned)

SELECT  "guests".* FROM "guests" WHERE "guests"."user_id" = $1 LIMIT 1  [["user_id", 6]]
SELECT  "dish_assignments".* FROM "dish_assignments"  ORDER BY "dish_assignments"."id" ASC LIMIT 1
SELECT  "dish_assignments".* FROM "dish_assignments" WHERE "dish_assignments"."menu_item_id" = $1 LIMIT 1  [["menu_item_id", 40]]
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT 1  [["id", 40]]
SELECT "menu_items".* FROM "menu_items"
INSERT INTO "dish_assignments" ("guest_id", "menu_item_id") VALUES ($1, $2) RETURNING "id"  [["guest_id", 5], ["menu_item_id", 40]]
---
  def update
    guest = Guest.find_by(user_id: current_user.id)
    @dish_assignment = DishAssignment.first
    @new_items = MenuItem.find(params[:dish_assignment][:menu_item_ids])
    @new_items.each do |new_item|
      dish_assignment = new_item.build_dish_assignment(guest_id: guest.id)
      dish_assignment.save

SELECT  "dish_assignments".* FROM "dish_assignments" WHERE "dish_assignments"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "dish_assignments" WHERE "dish_assignments"."id" = $1  [["id", 5]]
SELECT  "dish_assignments".* FROM "dish_assignments"  ORDER BY "dish_assignments"."id" ASC LIMIT 1
---
  def destroy
    old_dish = DishAssignment.find(params[:id])
    old_dish.destroy

    @dish_assignment = DishAssignment.first

SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 3]]
---
  def find_dinner
    @dinner = Dinner.find(params[:dinner_id])