DinnerParty/app/controllers/invitations_controller.rb

  def new
    @invitation = Invitation.new
    @dinner = Dinner.find(params[:dinner_id])
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 8]]

  def create
    @dinner = Dinner.find(params[:dinner_id])
    invitation_params[:user_ids].each do |user_id|
      @guest = Guest.find_or_create_by(user_id: user_id)
      binding.pry
      @dinner.invitations.build(guest_id: @guest.id)
    end
    @dinner.save
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "guests" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["created_at", "2015-11-04 15:36:17.905844"], ["updated_at", "2015-11-04 15:36:17.905844"]]
SELECT  "guests".* FROM "guests" WHERE "guests"."user_id" = $1 LIMIT 1  [["user_id", 2]]
INSERT INTO "invitations" ("guest_id", "dinner_id") VALUES ($1, $2) RETURNING "id"  [["guest_id", 2], ["dinner_id", 8]]

  def index
    @dinner = Dinner.find(params[:dinner_id])
---
SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 8]]