DinnerParty/app/controllers/menu_items_controller.rb

SELECT  dishes.* FROM "dishes" WHERE "dishes"."course" = $1 AND ("dishes"."id" NOT IN (6, 1, 3, 8, 11))  ORDER BY "dishes"."id" ASC LIMIT 1  [["course", "Main Dish"]]
---
  def new
    @menu_item = MenuItem.new
    @menu_ids = MenuItem.existing_menu_ids(@dinner.id) || []

    main_dishes = Dish.select("dishes.*").where(course: "Main Dish").where.not(id: @menu_ids)

INSERT INTO "dishes" ("name", "course") VALUES ($1, $2) RETURNING "id"  [["name", ""], ["course", "user added"]]
INSERT INTO "menu_items" ("dish_id", "dinner_id", "recipe_title", "recipe_url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dish_id", 13], ["dinner_id", 9], ["recipe_title", "World’s Best Lasagna"], ["recipe_url", "http://food2fork.com/view/34678"]]
---
  def create
    if params[:menu_item]
      params[:menu_item][:dish_ids].each do |dish_id|
        MenuItem.create(dish_id: dish_id, dinner_id: @dinner.id)

SELECT  "menu_items".* FROM "menu_items" INNER JOIN "dishes" ON "dishes"."id" = "menu_items"."dish_id" WHERE "menu_items"."dinner_id" = $1 AND "dishes"."course" = $2  ORDER BY "menu_items"."id" ASC LIMIT 1  [["dinner_id", 1], ["course", "Main Dish"]]
---
  def index
    main_dishes = MenuItem.joins(:dish).where(dinner_id: @dinner.id, dishes: {course: "Main Dish"})

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT 1  [["id", 23]]
DELETE FROM "menu_items" WHERE "menu_items"."id" = $1  [["id", 23]]
---
  def destroy
    menu_item = MenuItem.find(params[:id])
    menu_item.destroy

SELECT  "dinners".* FROM "dinners" WHERE "dinners"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_dinner
    @dinner = Dinner.find(params[:dinner_id])