DinnerParty/app/controllers/menu_items_controller.rb

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."dinner_id" = $1  [["dinner_id", 1]]
---
  def new
    @menu_item = MenuItem.new
    @menu_ids = MenuItem.existing_menu_ids(@dinner.id) || []
    @all_dishes = Dish.find_available_dishes(@dinner.id, @menu_ids)

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 0]]
---
  def create
    client = Adapters::MenuItemClient.new
    if params[:menu_item]
      params[:menu_item][:dish_ids].each do |dish_id|
        dish = Dish.find(dish_id)