DinnerParty/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 LIMIT 1  [["provider", "facebook"], ["uid", "10156127771700468"]]
INSERT INTO "users" ("provider", "uid", "name", "profile_picture") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "facebook"], ["uid", "10156127771700468"], ["name", "Jessie Nadler"], ["profile_picture", "http://graph.facebook.com/10156127771700468/picture"]]
---
  def create
    @user = User.find_by_provider_and_uid(auth_hash)
    if @user
      session[:user_id] = @user.id
    else
      @user = User.create_with_omniauth(auth_hash)