DinnerParty/app/views/dish_assignments/new.html.erb

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 13]]
---
    <% if course_array.any? %>
      <h2><%= course_array.first.dish.course %></h2>