DinnerParty/app/views/dinners/show.html.erb

<ul>
<% @dinner.guests.each do |guest| %>
---
SELECT "guests".* FROM "guests" INNER JOIN "invitations" ON "guests"."id" = "invitations"."guest_id" WHERE "invitations"."dinner_id" = $1  [["dinner_id", 9]]