DinnerParty/app/views/users/show.html.erb

    <% if @user_show.guest %>
      <% @user_show.guest.invitations.each do |invitation| %>
---
SELECT  "guests".* FROM "guests" WHERE "guests"."user_id" = $1 LIMIT 1  [["user_id", 6]]
SELECT "invitations".* FROM "invitations" WHERE "invitations"."guest_id" = $1  [["guest_id", 5]]

    <% if @user_show.host %>
      <% @user_show.host.dinners.each do |dinner| %>
---
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."user_id" = $1 LIMIT 1  [["user_id", 6]]
SELECT "dinners".* FROM "dinners" WHERE "dinners"."host_id" = $1  [["host_id", 4]]