DinnerParty/app/views/menu_items/index.html.erb

    <% if dish_type.any? %>
      <h2><%= dish_type.first.dish.course %></h2>
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 27]]